zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_MC_ME.h
#define MC_ME_PRTN1_COFB2_STAT_BLOCK79_MASK      (0x8000U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK79_SHIFT     (15U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK79_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK79(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK79_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK79_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK80_MASK      (0x10000U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK80_SHIFT     (16U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK80_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK80(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK80_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK80_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK81_MASK      (0x20000U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK81_SHIFT     (17U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK81_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK81(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK81_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK81_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK84_MASK      (0x100000U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK84_SHIFT     (20U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK84_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK84(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK84_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK84_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK85_MASK      (0x200000U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK85_SHIFT     (21U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK85_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK85(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK85_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK85_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK86_MASK      (0x400000U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK86_SHIFT     (22U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK86_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK86(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK86_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK86_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK87_MASK      (0x800000U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK87_SHIFT     (23U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK87_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK87(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK87_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK87_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK88_MASK      (0x1000000U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK88_SHIFT     (24U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK88_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK88(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK88_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK88_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK89_MASK      (0x2000000U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK89_SHIFT     (25U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK89_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK89(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK89_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK89_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK92_MASK      (0x10000000U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK92_SHIFT     (28U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK92_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK92(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK92_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK92_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK93_MASK      (0x20000000U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK93_SHIFT     (29U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK93_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK93(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK93_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK93_MASK)

#define MC_ME_PRTN1_COFB2_STAT_BLOCK95_MASK      (0x80000000U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK95_SHIFT     (31U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK95_WIDTH     (1U)
#define MC_ME_PRTN1_COFB2_STAT_BLOCK95(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB2_STAT_BLOCK95_SHIFT)) & MC_ME_PRTN1_COFB2_STAT_BLOCK95_MASK)
/*! @} */

/*! @name PRTN1_COFB3_STAT - Partition 1 COFB Set 3 Clock Status Register */
/*! @{ */

#define MC_ME_PRTN1_COFB3_STAT_BLOCK96_MASK      (0x1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK96_SHIFT     (0U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK96_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK96(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK96_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK96_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK97_MASK      (0x2U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK97_SHIFT     (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK97_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK97(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK97_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK97_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK98_MASK      (0x4U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK98_SHIFT     (2U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK98_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK98(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK98_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK98_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK99_MASK      (0x8U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK99_SHIFT     (3U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK99_WIDTH     (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK99(x)        (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK99_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK99_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK100_MASK     (0x10U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK100_SHIFT    (4U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK100_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK100(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK100_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK100_MASK)

#define MC_ME_PRTN1_COFB3_STAT_BLOCK101_MASK     (0x20U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK101_SHIFT    (5U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK101_WIDTH    (1U)
#define MC_ME_PRTN1_COFB3_STAT_BLOCK101(x)       (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB3_STAT_BLOCK101_SHIFT)) & MC_ME_PRTN1_COFB3_STAT_BLOCK101_MASK)

